---
kind: property
id: P:Autodesk.Revit.DB.PrintSetup.InSession
source: html/8fa68bd4-9e97-f772-629b-25ef129939e3.htm
---
# Autodesk.Revit.DB.PrintSetup.InSession Property

The in-session Print Setting of Print Setup.

## Syntax (C#)
```csharp
public InSessionPrintSetting InSession { get; }
```